# 2. Напишите программу, которая принимает на вход число N и выдает 
# набор произведений чисел от 1 до N.
# 1 - 1 * 1, 2 - 1 * 2, 3 - 1 * 2 * 3, 4 - 1 * 2 * 3 * 4 и т.д.
# - 4 -> [1, 2, 6, 24]
# - 6 -> [1, 2, 6, 24, 120, 720]

N = int(input('Введите число N: '))
factorial = 1
for i in range(N):
    factorial = factorial * (i + 1)
    print(factorial, end = ' ')